In [ ]:
import pandas as pd

In [ ]:
# Load the new Excel file
df = pd.read_excel('employee_org_structure.xlsx', engine='openpyxl')

In [27]:
df.head(10)

,Emp ID,Name,Position,Level 1 Manager ID,Level 1 Manager Name,Level 2 Manager ID,Level 2 Manager Name,Level 3 Manager ID,Level 3 Manager Name
0,1,Alice,CEO,NaN,NaN,NaN,NaN,NaN,NaN
1,2,Bob,CTO,1.0,Alice,NaN,NaN,NaN,NaN
2,3,Charlie,CFO,1.0,Alice,NaN,NaN,NaN,NaN
3,4,David,Manager,3.0,Charlie,1.0,Alice,NaN,NaN
4,5,Eve,Analyst,3.0,Charlie,1.0,Alice,NaN,NaN
5,6,Alice,Manager,4.0,David,3.0,Charlie,1.0,Alice
6,7,Sam,Analyst,6.0,Alice,4.0,David,3.0,Charlie
7,8,Yara,Analyst,6.0,Alice,4.0,David,3.0,Charlie
8,9,Jack,Engineer,4.0,David,3.0,Charlie,1.0,Alice
9,10,Paul,Engineer,6.0,Alice,4.0,David,3.0,Charlie

In [ ]:
# Extract relevant columns for manager levels
manager_columns = [
    "Level 1 Manager ID", "Level 1 Manager Name",
    "Level 2 Manager ID", "Level 2 Manager Name",
    "Level 3 Manager ID", "Level 3 Manager Name",
]

In [ ]:
# Create a new DataFrame to store the transformed data
transformed_data = []

In [24]:
# Iterate through each row in the original DataFrame
for index, row in df.iterrows():
    # check each manager level
    for i in range(1, 4):
        # Get the manager details at each level
        manager_id = f'Level {i} Manager ID'
        manager_name = f'Level {i} Manager Name'

        # skip if the manager is not available at this level, except if level 1 is also not present
        if pd.isna(row[manager_id]) and i > 1:
            break
        transformed_data.append({
        'Emp ID': row['Emp ID'],
        'Name': row['Name'],
        'Position': row['Position'],
        'Manager Level': i,
        'Manager ID': row[manager_id],
        'Manager Name': row[manager_name]
        })

In [ ]:
# Convert the transformed data into a DataFrame
transformed_df = pd.DataFrame(transformed_data)

# write the data frame to an excel sheet
transformed_df.to_excel("transformed_org_structure.xlsx", index=False)

In [26]:
transformed_df.head(10)

   Emp ID     Name Position  Manager Level  Manager ID Manager Name
0       1    Alice      CEO              1         NaN          NaN
1       2      Bob      CTO              1         1.0        Alice
2       3  Charlie      CFO              1         1.0        Alice
3       4    David  Manager              1         3.0      Charlie
4       4    David  Manager              2         1.0        Alice
5       5      Eve  Analyst              1         3.0      Charlie
6       5      Eve  Analyst              2         1.0        Alice
7       6    Alice  Manager              1         4.0        David
8       6    Alice  Manager              2         3.0      Charlie
9       6    Alice  Manager              3         1.0        Alice